# IsolateElementsTemporary Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..IsolateElementsTemporary Method
View Class See Also
---
Set multiple elements to be temporarily isolated in the view. To isolate a group completely, you must also include all members of all groups and nested groups in your input.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void IsolateElementsTemporary(
	ICollection<ElementId> elementIds
)
```

Visual Basic
---
```text
Public Sub IsolateElementsTemporary ( _
	elementIds As ICollection(Of ElementId) _
)
```

Visual C++
---
```text
public:
void IsolateElementsTemporary(
	ICollection<ElementId^>^ elementIds
)
```

# ### Parameters
elementIds
    Type: System.Collections.Generic..::..ICollection<(Of <(<'ElementId>)>)> Ids of elements to be isolated.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
View Class
Autodesk.Revit.DB Namespace